## Let's work on Stats
heheh

In [34]:
import pandas as pd
import numpy as np

In [50]:
df=pd.read_csv('income.csv')

In [25]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [26]:
df.describe()

       Monthly Income ($)
count        7.000000e+00
mean         1.433929e+06
std          3.777283e+06
min          4.000000e+03
25%          5.500000e+03
50%          7.000000e+03
75%          7.750000e+03
max          1.000000e+07

In [27]:
df['Monthly Income ($)'].mode()

0        4000
1        5000
2        6000
3        7000
4        7500
5        8000
6    10000000
Name: Monthly Income ($), dtype: int64

In [28]:
df['Monthly Income ($)'].quantile(.99)

np.float64(9400479.999999994)

In [29]:

df.loc[df['Monthly Income ($)']>df['Monthly Income ($)'].quantile(.99)]

        Name  Monthly Income ($)
6  Elon Musk            10000000

In [40]:
df_new=df.loc[df['Monthly Income ($)']<df['Monthly Income ($)'].quantile(.99)]

In [41]:
df_new

    Name  Monthly Income ($)
0    Rob                5000
1  Rafiq                6000
2   Nina                4000
3  Sofia                7500
4  Mohan                8000
5    Tao                7000

In [42]:
df_new['Monthly Income ($)'][3]=np.nan

C:\Users\Dell\AppData\Local\Temp\ipykernel_4152\2875833533.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df_new['Monthly Income ($)'][3]=np.nan
C:\Users\Dell\AppData\Local\Temp\ipykernel_4152\2875833533.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new['Monthly Income ($)'][3]=np.nan

In [43]:
df_new

    Name  Monthly Income ($)
0    Rob              5000.0
1  Rafiq              6000.0
2   Nina              4000.0
3  Sofia                 NaN
4  Mohan              8000.0
5    Tao              7000.0

In [44]:
#if some value is nan like this then we can just do a analysis of the set and just do estimate some data
df['Monthly Income ($)'][3]=np.nan

C:\Users\Dell\AppData\Local\Temp\ipykernel_4152\729365989.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Monthly Income ($)'][3]=np.nan
C:\Users\Dell\AppData\Local\Temp\ipykernel_4152\729365989.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Monthly Income ($)'][3]=np.nan

In [45]:
df

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia                 NaN
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0

In [51]:
#we should not use avg since because of elon musk the avg is too high so we will use median for this
df.loc[df['Monthly Income ($)'].isna(),'Monthly Income ($)']=df['Monthly Income ($)'].median()

In [52]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000